scripts/simple.yml
config:
  target: "https://z3p7uq7zrk.execute-api.eu-central-1.amazonaws.com"
  phases:
    - duration: 10
      arrivalRate: 5
      name: Warm up
    - duration: 20
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 30
      arrivalRate: 50
      name: Sustained load

scenarios:
  - name: "Request the /echo endpoint with GET and use the requestId for POSTing back to the same url"
    flow:
      - get:
          url: "/echo?foo=bar"
          capture:
            - json: "$.requestContext.requestId"
              as: "requestId"
      - post:
          url: "/echo"
          json:
            request_id: "{{ requestId }}"